Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: do not update unless we absolutely have to.
zh_cn: 除非我们必须更新，否则不要更新。

source: due to an app switch, ANR, or some other state change.
zh_cn: 由于应用程序切换、ANR 或某些其他状态更改。

source: e.g. show an arrow to the left indicating the action that will be taken.
zh_cn: 例如在左侧显示一个箭头，指示将采取的操作。

source: elements:
zh_cn: 元素：

source: even if the holder is not removed, we still call this method so that it is removed from view holder lists.
zh_cn: 即使没有移除 holder，我们仍然调用此方法，以便从 view holder 列表中移除它。

source: example:
zh_cn: 示例：

source: fallback to pool
zh_cn: 回退到池

source: file location:
zh_cn: 文件位置：

source: find by id
zh_cn: 根据 id 找到

source: find by position
zh_cn: 根据位置找到

source: from a ConstraintLayout
zh_cn: 来自一个 ConstraintLayout

source: from a R.layout.* object
zh_cn: 来自 R.layout.* 对象

source: further.
zh_cn: 进一步。

source: handleError(); // with one generic handler!
zh_cn: handleError(); // 使用一个通用的处理器！

source: handling AccessibilityNodeInfo#ACTION_CLICK ACTION_CLICK when accessibility features are enabled
zh_cn: 启用无障碍功能时处理 AccessibilityNodeInfo#ACTION_CLICK ACTION_CLICK

source: handling AccessibilityNodeInfo#ACTION_CLICK when accessibility features are enabled
zh_cn: 启用辅助功能时处理 AccessibilityNodeInfo#ACTION_CLICK

source: hsv[0] is Hue [0 ..
zh_cn: hsv[0] 是 Hue（色相） [0 ..

source: if src is not found, is an unsupported format, or cannot be decoded for any reason.
zh_cn: 如果找不到 src，格式不受支持，或者因任何原因无法解码。

source: if we are running animations, it is actually better to keep it in scrap but this would force layout manager to lay it out which would be bad.
zh_cn: 如果我们正在运行动画，实际上最好是保持它在废料，但这将迫使布局管理器布局，这将是不好的。

source: inPurgeable is not supported.
zh_cn: 不支持 inPurgeable。

source: integer value identifying the type of the view needed to represent the item at position.
zh_cn: 用于表示在 position 处的项所需 View 的类型的整数值。

source: internal implementation checks if view is scrapped or attached and throws an exception if so.
zh_cn: 内部实现检查 view 是否被废弃或附加，如果是，则抛出异常。

source: invalid view holders may be in cache if adapter has stable ids as they can be retrieved via getScrapOrCachedViewForId
zh_cn: 如果适配器具有可通过 getScrapOrCachedViewForId 获取的稳定 id，则缓存中可能存在无效的 view holder

source: layout position: Position of an item in the latest layout calculation.
zh_cn: layout position (布局位置): item 在最近的一次计算中的位置。

source: layout resource file:
zh_cn: 布局资源文件：

source: make sure we don't rebind > item is removed then added to another position and we are in post layout.
zh_cn: 确保我们没有重新绑定。> 项目被移除，然后添加到另一个位置，我们在 post 布局。

source: obeying click sound preferences
zh_cn: 服从点击声音偏好设置

source: on the AutoCompleteTextView.
zh_cn: 在 AutoCompleteTextView 上。

source: only bother finding nested RV if prefetching
zh_cn: 只有在预取时才麻烦查找嵌套的 RV

source: or
zh_cn: 或

source: outHeight will be set to -1 if there is an error trying to decode.
zh_cn: 如果尝试解码时出错，outHeight 将被设置为-1。

source: outWidth will be set to -1 if there is an error trying to decode.
zh_cn: 如果尝试解码时出错，outWidth 将被设置为-1。

source: position to query
zh_cn: 要查询的位置

source: process the long click action immediately
zh_cn: 立即处理长单击操作

source: recycle holder (and unscrap if relevant) since it can't be used
zh_cn: 回收 holder(并且 unscrap 如果相关)，因为它不能使用

source: repeat the shader's image horizontally and vertically
zh_cn: 水平和垂直地重复着色器的图像

source: repeat the shader's image horizontally and vertically, alternating mirror images so that adjacent images always seam
zh_cn: 水平和垂直地重复着色器的图像，交替镜像，使相邻的图像总是接缝

source: replicate the edge color if the shader draws outside of its original bounds
zh_cn: 如果着色器在其原始边界之外绘制，则复制边缘颜色

source: resource reference:
zh_cn: 资源引用：

source: restore action in case it was changed
zh_cn: 恢复操作以防更改

source: return as is.
zh_cn: 原样返回，

source: return with the constraint set will apply elevation for the specified view.
zh_cn: 返回指定 view 的约束集将要应用的 elevation。

source: rotation of the view around the x axis, in degrees.
zh_cn: 围绕 x 轴旋转 view，以度为单位。

source: rotation of the view around the y axis, in degrees.
zh_cn: 绕 y 轴旋转 view，以度为单位。

source: rotation of the view, in degrees.
zh_cn: view 的旋转，以度为单位。

source: scale of the view in the x direction.
zh_cn: x 方向 view 的比例。

source: scale of the view in the y direction.
zh_cn: y 方向 view 的比例。

source: set if elevation will be applied to the view.
zh_cn: 设置 view 是否应用 elevation。

source: someComplicatedIOFunction(); // may throw IOException
zh_cn: someComplicatedIOFunction(); // 可能抛出 IOException

source: someComplicatedParsingFunction(); // may throw ParsingException
zh_cn: someComplicatedParsingFunction(); // 可能抛出 ParsingException

source: someComplicatedSecurityFunction(); // may throw SecurityException
zh_cn: someComplicatedSecurityFunction(); // 可能抛出 SecurityException

source: specifying a fixed distance from the left or the top of a layout (layout_constraintGuide_begin)
zh_cn: 指定相对于一个布局的左边或上边的固定距离 (layout_constraintGuide_begin)

source: specifying a fixed distance from the right or the bottom of a layout (layout_constraintGuide_end)
zh_cn: 指定相对于一个布局的右边或底边的固定距离 (layout_constraintGuide_end)

source: specifying a percentage of the width or the height of a layout (layout_constraintGuide_percent)
zh_cn: 指定相对于一个布局的宽度或高度的百分比 (layout_constraintGuide_percent)

source: syntax:
zh_cn: 语法：

source: take focus if we don't have it already and we should in touch mode.
zh_cn: 如果我们还没有焦点，获取焦点，我们应该在接触模式。

source: the stable ID of the item at position
zh_cn: 在位置处的项的稳定 ID

source: this might be valid in two cases: > item is removed but we are in pre-layout pass >> do nothing.
zh_cn: 这可能在两种情况下有效。> 项被移除，但我们在预布局过程中。>> 不做任何操作，

source: to be a String resource reference (e.g.
zh_cn: 预期是一个 resource 资源引用。

source: to be a fraction resource reference.
zh_cn: 预期是一个 fraction 资源引用。

source: to be a layout resource reference (e.g.
zh_cn: 预期是一个 layout 资源引用。

source: to be a menu resource reference.
zh_cn: 预期是一个 menu 资源引用。

source: to be a plurals resource reference.
zh_cn: 预期是一个 plurals 资源引用。

source: to be a raw resource reference.
zh_cn: 预期是一个 raw 资源引用。

source: to be a style resource reference (e.g.
zh_cn: 预期是一个 style 资源引用。

source: to be a styleable resource reference (e.g.
zh_cn: 预期是一个 styleable 资源引用。

source: to be a transition resource reference.
zh_cn: 预期是一个 transition 资源引用。

source: to be an XML resource reference.
zh_cn: 预期是一个 XML 资源引用。

source: to be an id resource reference (e.g.
zh_cn: 预期是一个 id 资源引用。

source: to be an integer resource reference (e.g.
zh_cn: 预期是一个 integer 资源引用。

source: to be an interpolator resource reference (e.g.
zh_cn: 预期是一个 interpolator 资源引用。

source: to represent a pixel dimension.
zh_cn: 预期是一个像素尺寸。

source: translation in x of the view.
zh_cn: 在 view 的 x 中移动。

source: translation in y of the view.
zh_cn: 在 view 的 y 中移动。

source: translation in z of the view.
zh_cn: 在 view 的 z 中移动。

source: true if the lifted state changed
zh_cn: 如果提升状态更改，则为 true

source: true if the shader has a non-identity local matrix
zh_cn: 如果 shader 具有非同一的局部矩阵，则返回 true。

source: true if this ViewParent accepts the nested scroll operation
zh_cn: 如果此 ViewParent 接受嵌套滚动操作，则返回 true

source: true if this parent consumed or otherwise reacted to the fling
zh_cn: 如果此 parent 消耗或以其他方式对 fling 做出反应，则为 true

source: true if this parent consumed the fling ahead of the target view
zh_cn: 如果此父级在目标 view 之前消耗了 fling，则返回 true

source: type and that its value should be one of the explicitly named constants.
zh_cn: 表示一个逻辑类型，并且它的值应该是显示指明的常量之一。

source: update position
zh_cn: 更新位置

source: visible than otherwise necessary to make code testable.
zh_cn: 它比必要的可见性更广以使代码更可测试。

source: we cannot re-use cached views in this case.
zh_cn: 在这种情况下，我们不能重用缓存 view。

source: we need to force it to become invisible
zh_cn: 我们需要强制它不可见

source: we would like to recycle this but need to make sure it is not used by animation logic etc.
zh_cn: 我们想回收这个，但需要确保它不是用于动画逻辑等。

source: when adding the view, skip past most recently prefetched views
zh_cn: 添加 view 时，跳过最近预取的 view

source: will set the height of the button following a 16:9 ratio, while the width of the button will match the constraints to parent.
zh_cn: 将设置按钮的高度遵从 16:9 的比例，按钮的宽度将匹配 parent 的约束。

source: will set the height of the button to be the same as its width.
zh_cn: 将把按钮的宽度设置为与高度相同。

source: x location of the pivot point around which the view will rotate and scale.
zh_cn: x 枢轴点的位置，view 将围绕该位置旋转和缩放。

source: y location of the pivot point around which the view will rotate and scale.
zh_cn: y 枢轴点的位置，view 将围绕该位置旋转和缩放。

source: you would need to do:
zh_cn: 你需要做：
